package damo.util.method.methodType;



import org.springframework.stereotype.Component;

@Component
public   class UtilName {
	public String acheiveName() {
		String name = null;
		for (int i = 0; i < 10; i++) {
			String[] firsname = { "赵", "钱", "孙", "李", "周", "吴", "郑", "王", "冯", "陈", "楮", "卫", "蒋", "沈", "韩", "杨", "朱",
					"秦", "尤", "许", "何", "吕", "施", "张", "孔", "曹", "严", "华", "金", "魏", "陶", "姜", "戚", "谢", "邹", "喻", "柏",
					"水", "窦", "章", "云", "苏", "潘", "葛", "奚", "范", "彭", "郎", "鲁", "韦", "昌", "马", "苗", "凤", "花", "方", "俞",
					"任", "袁", "柳", "酆", "鲍", "史", "唐", "费", "廉", "岑", "薛", "雷", "贺", "倪", "汤", "滕", "殷", "罗", "毕", "郝",
					"邬", "安", "常", "乐", "于", "时", "傅", "皮", "卞", "齐", "康", "伍", "余", "元", "卜", "顾", "孟", "平", "黄", "和",
					"穆", "萧", "尹", "姚", "邵", "湛", "汪", "祁", "毛", "禹", "狄", "米", "贝", "明", "臧", "计", "伏", "成", "戴", "谈",
					"宋", "茅", "庞", "熊", "纪", "舒", "屈", "项", "祝", "董", "梁", "杜", "阮", "蓝", "闽", "席", "季", "麻", "强", "贾",
					"路", "娄", "危", "江", "童", "颜", "郭", "梅", "盛", "林", "刁", "锺", "徐", "丘", "骆", "高", "夏", "蔡", "田", "樊",
					"胡", "凌", "霍", "虞", "万", "支", "柯", "昝", "管", "卢", "莫", "经", "房", "裘", "缪", "干", "解", "应", "宗", "丁",
					"宣", "贲", "邓", "郁", "单", "杭", "洪", "包", "诸", "左", "石", "崔", "吉", "钮", "龚", "程", "嵇", "邢", "滑", "裴",
					"陆", "荣", "翁", "荀", "羊", "於", "惠", "甄", "麹", "家", "封", "芮", "羿", "储", "靳", "汲", "邴", "糜", "松", "井",
					"段", "富", "巫", "乌", "焦", "巴", "弓", "牧", "隗", "山", "谷", "车", "侯", "宓", "蓬", "全", "郗", "班", "仰", "秋",
					"仲", "伊", "宫", "宁", "仇", "栾", "暴", "甘", "斜", "厉", "戎", "祖", "武", "符", "刘", "景", "詹", "束", "龙", "叶",
					"幸", "司", "韶", "郜", "黎", "蓟", "薄", "印", "宿", "白", "怀", "蒲", "邰", "从", "鄂", "索", "咸", "籍", "赖", "卓",
					"蔺", "屠", "蒙", "池", "乔", "阴", "郁", "胥", "能", "苍", "双", "闻", "莘", "党", "翟", "谭", "贡", "劳", "逄", "姬",
					"申", "扶", "堵", "冉", "宰", "郦", "雍", "郤", "璩", "桑", "桂", "濮", "牛", "寿", "通", "边", "扈", "燕", "冀", "郏",
					"浦", "尚", "农", "温", "别", "庄", "晏", "柴", "瞿", "阎", "充", "慕", "连", "茹", "习", "宦", "艾", "鱼", "容", "向",
					"古", "易", "慎", "戈", "廖", "庾", "终", "暨", "居", "衡", "步", "都", "耿", "满", "弘", "匡", "国", "文", "寇", "广",
					"禄", "阙", "东", "欧", "殳", "沃", "利", "蔚", "越", "夔", "隆", "师", "巩", "厍", "聂", "晁", "勾", "敖", "融", "冷",
					"訾", "辛", "阚", "那", "简", "饶", "空", "曾", "毋", "沙", "乜", "养", "鞠", "须", "丰", "巢", "关", "蒯", "相", "查",
					"后", "荆", "红", "游", "竺", "权", "逑", "盖", "益", "桓", "公", "万俟", "司马", "上官", "欧阳", "夏侯", "诸葛", "闻人",
					"东方", "赫连", "皇甫", "尉迟", "公羊", "澹台", "公冶", "宗政", "濮阳", "淳于", "单于", "太叔", "申屠", "公孙", "仲孙", "轩辕",
					"令狐", "锺离", "宇文", "长孙", "慕容", "鲜于", "闾丘", "司徒", "司空", "丌官", "司寇", "仉", "督", "子车", "颛孙", "端木", "巫马",
					"公西", "漆雕", "乐正", "壤驷", "公良", "拓拔", "夹谷", "宰父", "谷梁", "晋", "楚", "阎", "法", "汝", "鄢", "涂", "钦", "段干",
					"百里", "东郭", "南门", "呼延", "归", "海", "羊舌", "微生", "岳", "帅", "缑", "亢", "况", "后", "有", "琴", "梁丘", "左丘",
					"东门", "西门", "商", "牟", "佘", "佴", "伯", "赏", "南宫", "墨", "哈", "谯", "笪", "年", "爱", "阳", "佟" };
			String[] namelist = { "伟", "伟", "芳", "伟", "秀英", "秀英", "娜", "秀英", "伟", "敏", "静", "丽", "静", "丽", "强", "静",
					"敏", "敏", "磊", "军", "洋", "勇", "勇", "艳", "杰", "磊", "强", "军", "杰", "娟", "艳", "涛", "涛", "明", "艳", "超",
					"勇", "娟", "杰", "秀兰", "霞", "敏", "军", "丽", "强", "平", "刚", "杰", "桂英", "芳", "　嘉懿", "煜城", "懿轩", "烨伟",
					"苑博", "伟泽", "熠彤", "鸿煊", "博涛", "烨霖", "烨华", "煜祺", "智宸", "正豪", "昊然", "明杰", "立诚", "立轩", "立辉", "峻熙",
					"弘文", "熠彤", "鸿煊", "烨霖", "哲瀚", "鑫鹏", "致远", "俊驰", "雨泽", "烨磊", "晟睿", "天佑", "文昊", "修洁", "黎昕", "远航",
					"旭尧", "鸿涛", "伟祺", "荣轩", "越泽", "浩宇", "瑾瑜", "皓轩", "擎苍", "擎宇", "志泽", "睿渊", "楷瑞", "子轩", "弘文", "哲瀚",
					"雨泽", "鑫磊", "修杰", "伟诚", "建辉", "晋鹏", "天磊", "绍辉", "泽洋", "明轩", "健柏", "鹏煊", "昊强", "伟宸", "博超", "君浩",
					"子骞", "明辉", "鹏涛", "炎彬", "鹤轩", "越彬", "风华", "靖琪", "明诚", "高格", "光华", "国源", "冠宇", "晗昱", "涵润", "翰飞",
					"翰海", "昊乾", "浩博", "和安", "弘博", "宏恺", "鸿朗", "华奥", "华灿", "嘉慕", "坚秉", "建明", "金鑫", "锦程", "瑾瑜", "晋鹏",
					"经赋", "景同", "靖琪", "君昊", "俊明", "季同", "开济", "凯安", "康成", "乐语", "力勤", "良哲", "理群", "茂彦", "敏博", "明达",
					"朋义", "彭泽", "鹏举", "濮存", "溥心", "璞瑜", "浦泽", "奇邃", "祺祥", "荣轩", "锐达", "睿慈", "绍祺", "圣杰", "晟睿", "思源",
					"斯年", "泰宁", "天佑", "同巍", "奕伟", "祺温", "文虹", "向笛", "心远", "欣德", "新翰", "兴言", "星阑", "修为", "旭尧", "炫明",
					"学真", "雪风", "雅昶", "阳曦", "烨熠", "英韶", "永贞", "咏德", "宇寰", "雨泽", "玉韵", "越彬", "蕴和", "哲彦", "振海", "正志",
					"子晋", "自怡", "德赫", "君平" };
			int a = (int) Math.abs(firsname.length * Math.random());
			int b = (int) Math.abs(namelist.length * Math.random());
			name = firsname[a] + namelist[b];

		}
		return name;
	}

	public void achieveNameTemp() {
		String[] sName = new String[95];
		String[] Name = new String[79];
		sName[0] = "白|bai";
		sName[1] = "白|bai";
		sName[2] = "蔡|cai";
		sName[3] = "曹|cao";
		sName[4] = "陈|chen";
		sName[5] = "戴|dai";
		sName[6] = "窦|dou";
		sName[7] = "邓|deng";
		sName[8] = "狄|di";
		sName[9] = "杜|du";
		sName[10] = "段|duan";
		sName[11] = "范|fan";
		sName[12] = "樊|fan";
		sName[13] = "房|fang";
		sName[14] = "风|feng";
		sName[15] = "符|fu";
		sName[16] = "福|fu";
		sName[17] = "高|gao";
		sName[18] = "古|gu";
		sName[19] = "关|guan";
		sName[20] = "郭|guo";
		sName[21] = "毛|mao";
		sName[22] = "韩|han";
		sName[23] = "胡|hu";
		sName[24] = "花|hua";
		sName[25] = "洪|hong";
		sName[26] = "侯|hou";
		sName[27] = "黄|huang";
		sName[28] = "贾|jia";
		sName[29] = "蒋|jiang";
		sName[30] = "金|jin";
		sName[31] = "廖|liao";
		sName[32] = "梁|liang";
		sName[33] = "李|li";
		sName[34] = "林|lin";
		sName[35] = "刘|liu";
		sName[36] = "龙|long";
		sName[37] = "陆|lu";
		sName[38] = "卢|lu";
		sName[39] = "罗|luo";
		sName[40] = "马|ma";
		sName[41] = "牛|niu";
		sName[42] = "庞|pang";
		sName[43] = "裴|pei";
		sName[44] = "彭|peng";
		sName[45] = "戚|qi";
		sName[46] = "齐|qi";
		sName[47] = "钱|qian";
		sName[48] = "乔|qiao";
		sName[49] = "秦|qin";
		sName[50] = "邱|qiu";
		sName[51] = "裘|qiu";
		sName[52] = "仇|qiu";
		sName[53] = "沙|sha";
		sName[54] = "商|shang";
		sName[55] = "尚|shang";
		sName[56] = "邵|shao";
		sName[57] = "沈|shen";
		sName[58] = "师|shi";
		sName[59] = "施|shi";
		sName[60] = "宋|song";
		sName[61] = "孙|sun";
		sName[62] = "童|tong";
		sName[63] = "万|wan";
		sName[64] = "王|wang";
		sName[65] = "魏|wei";
		sName[66] = "卫|wei";
		sName[67] = "吴|wu";
		sName[68] = "武|wu";
		sName[69] = "萧|xiao";
		sName[70] = "肖|xiao";
		sName[71] = "项|xiang";
		sName[72] = "许|xu";
		sName[73] = "徐|xu";
		sName[74] = "薛|xue";
		sName[75] = "杨|yang";
		sName[76] = "羊|yang";
		sName[77] = "阳|yang";
		sName[78] = "易|yi";
		sName[79] = "尹|yin";
		sName[80] = "俞|yu";
		sName[81] = "赵|zhao";
		sName[82] = "钟|zhong";
		sName[83] = "周|zhou";
		sName[84] = "郑|zheng";
		sName[85] = "朱|zhu";
		sName[86] = "东方|dongfang";
		sName[87] = "独孤|dugu";
		sName[88] = "慕容|murong";
		sName[89] = "欧阳|ouyang";
		sName[90] = "司马|sima";
		sName[91] = "西门|ximen";
		sName[92] = "尉迟|yuchi";
		sName[93] = "长孙|zhangsun";
		sName[94] = "诸葛|zhuge";
		Name[0] = "ai|皑艾哀";
		Name[1] = "an|安黯谙";
		Name[2] = "ao|奥傲敖骜翱";
		Name[3] = "ang|昂盎";
		Name[4] = "ba|罢霸";
		Name[5] = "bai|白佰";
		Name[6] = "ban|斑般";
		Name[7] = "bang|邦";
		Name[8] = "bei|北倍贝备";
		Name[9] = "biao|表标彪飚飙";
		Name[10] = "bian|边卞弁忭";
		Name[11] = "bu|步不";
		Name[12] = "cao|曹草操漕";
		Name[13] = "cang|苍仓";
		Name[14] = "chang|常长昌敞玚";
		Name[15] = "chi|迟持池赤尺驰炽";
		Name[16] = "ci|此次词茨辞慈";
		Name[17] = "du|独都";
		Name[18] = "dong|东侗";
		Name[19] = "dou|都";
		Name[20] = "fa|发乏珐";
		Name[21] = "fan|范凡反泛帆蕃";
		Name[22] = "fang|方访邡昉";
		Name[23] = "feng|风凤封丰奉枫峰锋";
		Name[24] = "fu|夫符弗芙";
		Name[25] = "gao|高皋郜镐";
		Name[26] = "hong|洪红宏鸿虹泓弘";
		Name[27] = "hu|虎忽湖护乎祜浒怙";
		Name[28] = "hua|化花华骅桦";
		Name[29] = "hao|号浩皓蒿浩昊灏淏";
		Name[30] = "ji|积极济技击疾及基集记纪季继吉计冀祭际籍绩忌寂霁稷玑芨蓟戢佶奇诘笈畿犄";
		Name[31] = "jian|渐剑见建间柬坚俭";
		Name[32] = "kan|刊戡";
		Name[33] = "ke|可克科刻珂恪溘牁";
		Name[34] = "lang|朗浪廊琅阆莨";
		Name[35] = "li|历离里理利立力丽礼黎栗荔沥栎璃";
		Name[36] = "lin|临霖林琳";
		Name[37] = "ma|马";
		Name[38] = "mao|贸冒貌冒懋矛卯瑁";
		Name[39] = "miao|淼渺邈";
		Name[40] = "nan|楠南";
		Name[41] = "pian|片翩";
		Name[42] = "qian|潜谦倩茜乾虔千";
		Name[43] = "qiang|强羌锖玱";
		Name[44] = "qin|亲琴钦沁芩矜";
		Name[45] = "qing|清庆卿晴";
		Name[46] = "ran|冉然染燃";
		Name[47] = "ren|仁刃壬仞";
		Name[48] = "sha|沙煞";
		Name[49] = "shang|上裳商";
		Name[50] = "shen|深审神申慎参莘";
		Name[51] = "shi|师史石时十世士诗始示适炻";
		Name[52] = "shui|水";
		Name[53] = "si|思斯丝司祀嗣巳";
		Name[54] = "song|松颂诵";
		Name[55] = "tang|堂唐棠瑭";
		Name[56] = "tong|统通同童彤仝";
		Name[57] = "tian|天田忝";
		Name[58] = "wan|万宛晚";
		Name[59] = "wei|卫微伟维威韦纬炜惟玮为";
		Name[60] = "wu|吴物务武午五巫邬兀毋戊";
		Name[61] = "xi|西席锡洗夕兮熹惜";
		Name[62] = "xiao|潇萧笑晓肖霄骁校";
		Name[63] = "xiong|熊雄";
		Name[64] = "yang|羊洋阳漾央秧炀飏鸯";
		Name[65] = "yi|易意依亦伊夷倚毅义宜仪艺译翼逸忆怡熠沂颐奕弈懿翊轶屹猗翌";
		Name[66] = "yin|隐因引银音寅吟胤訚烟荫";
		Name[67] = "ying|映英影颖瑛应莹郢鹰";
		Name[68] = "you|幽悠右忧猷酉";
		Name[69] = "yu|渔郁寓于余玉雨语预羽舆育宇禹域誉瑜屿御渝毓虞禺豫裕钰煜聿";
		Name[70] = "zhi|制至值知质致智志直治执止置芝旨峙芷挚郅炙雉帜";
		Name[71] = "zhong|中忠钟衷";
		Name[72] = "zhou|周州舟胄繇昼";
		Name[73] = "zhu|竹主驻足朱祝诸珠著竺";
		Name[74] = "zhuo|卓灼灼拙琢濯斫擢焯酌";
		Name[75] = "zi|子资兹紫姿孜梓秭";
		Name[76] = "zong|宗枞";
		Name[77] = "zu|足族祖卒";
		Name[78] = "zuo|作左佐笮凿";


	}}
